cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'johanhaleby/kubetail'

# Cask
cask '1password'
cask 'appcleaner'
cask 'chronoagent'
cask 'chronosync'
cask 'dash'
cask 'devonthink-pro-office'
cask 'emacs'
cask 'firefox'
cask 'iterm2'
cask 'launchbar'
cask 'little-snitch'
cask 'minikube'
cask 'omnigraffle'
cask 'paw'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'r-app'
cask 'steermouse'
cask 'sonos'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'webex-teams'
cask 'wireshark'

# Fonts
cask 'font-hack'

# Packages
brew 'aspell'
brew 'bash-completion'
brew 'chruby'
brew 'diff-so-fancy'
brew 'fping'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'gopass'
brew 'hub'
brew 'hugo'
brew 'jq'
brew 'kubectl'
brew 'kubectx', args: ["with-short-names"]
brew 'kubetail', args: ["with-short-names"]
brew 'kubernetes-helm'
brew 'kubernetes-cli'
brew 'nmap'
brew 'packer'
brew 'pinentry-mac'
brew 'pv'
brew 'reattach-to-user-namespace'
brew 'ruby-install'
brew 'shellcheck'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'xz'

# Mac App Store
