cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'd12frosted/emacs-plus'

# Cask
cask 'alfred'
cask 'appcleaner'
cask 'CodeRunner'
cask 'devonthink'
cask 'docker'
cask 'google-chrome'
cask 'graphiql'
cask 'iterm2'
cask 'launchbar'
cask 'logitech-options'
cask 'logitech-unifying'
cask 'firefox-developer-edition'
cask 'microsoft-edge'
cask 'omnigraffle'
cask 'paw'
cask 'pgadmin4'
cask 'r'
cask 'signal'
cask 'sonos'
cask 'transmit'
cask 'vagrant'

# Fonts
cask 'font-hack'
cask 'font-fontawesome'
cask 'font-fira-code'

# Packages
brew 'bat'
brew 'ctop'
brew 'chruby'
brew 'dive'
brew 'docker-machine'
brew 'docker-machine-driver-hyperkit'
brew 'emacs-plus@27'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fping'
brew 'fossil'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gnupg'
brew 'go'
brew 'golang-migrate'
brew 'gopass'
brew 'goreleaser'
brew 'hub'
brew 'hugo'
brew 'hyperkit'
brew 'jq'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'nomad'
brew 'packer'
brew 'pandoc'
brew 'paperkey'
brew 'pgweb'
brew 'pinentry-mac'
brew 'postgresql'
brew 'pv'
brew 'reattach-to-user-namespace'
brew 'ruby-install'
brew 'ripgrep'
brew 'starship'
brew 'shellcheck'
brew 'sqlite'
brew 'terraform'
brew 'tectonic'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'

## Mac App Store
mas 'Final Cut Pro', id: 424389933
mas 'Compressor', id: 424390742
mas 'Amphetamine', id: 937984704
mas 'Things', id: 904280696
mas 'Moom', id: 419330170
mas 'Affinity Photo', id: 824183456
