cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'd12frosted/emacs-plus'

# Cask
cask 'appcleaner'
cask 'vagrant'
cask 'virtualbox'

# Fonts
cask 'font-hack'
cask 'font-fontawesome'

# Packages
brew 'antibody'
brew 'bat'
brew 'bash'
brew 'bash-completion'
brew 'chruby'
brew 'coreutils'
brew 'dive'
brew 'docker-machine'
brew 'docker-machine-driver-hyperkit'
brew 'emacs-plus'
brew 'fping'
brew 'fd'
brew 'git'
brew 'git-bug'
brew 'git-delta'
brew 'gnupg'
brew 'go'
brew 'golang-migrate'
brew 'gopass'
brew 'goreleaser'
brew 'hub'
brew 'hugo'
brew 'hyperkit'
brew 'jq'
brew 'node'
brew 'packer'
brew 'pandoc'
brew 'pinentry-mac'
brew 'postgresql'
brew 'pv'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'ruby-install'
brew 'ripgrep'
brew 'shellcheck'
brew 'sqlite'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'watch'
brew 'xz'
brew 'zsh'
