cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'

# Cask
cask 'alfred'
cask 'basictex'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'omnifocus'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'spotify'
cask 'sublime-text'
cask 'transmit'
cask 'vagrant'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'

# Packages
brew 'ansible'
brew 'bash'
brew 'bash-completion'
brew 'curl', args: ['with-libressl', 'with-nghttp2']
brew 'fping'
brew 'git', args: ['with-brewed-curl']
brew 'go'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'lnav'
brew 'mas'
brew 'nmap'
brew 'nuttcp'
brew 'packer'
brew 'pt'
brew 'pv'
brew 'python'
brew 'shellcheck'
brew 'tree'
brew 'vim'
brew 'wget', args: ['with-libressl']
brew 'xz'

# Apps
mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'DaisyDisk', id: 411643860
mas 'Divvy', id: 413857545
mas 'Microsoft Remote Desktop', id: 715768417
mas 'MindNode', id: 992076693
mas 'MsgFiler', id: 418778021
mas 'Textual', id: 896450579
