cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'justwatchcom/gopass'

# Cask
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-fontawesome'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'

# Packages
brew 'bash'
brew 'bash-completion'
brew 'curl'
brew 'fping'
brew 'git'
brew 'go'
brew 'gopass'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'lnav'
brew 'mas'
brew 'nmap'
brew 'packer'
brew 'pandoc'
brew 'nodejs'
brew 'pinentry-mac'
brew 'pt'
brew 'pv'
brew 'python'
brew 'qemu'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'xz'
