cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'go-delve/delve'
tap 'justwatchcom/gopass'

# Cask
cask 'atom'
cask 'alfred'
cask 'cyberduck'
cask 'firefox'
cask 'github-desktop'
cask 'githubpulse'
cask 'google-chrome'
cask 'java'
cask 'little-snitch'
cask 'paw'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'spotify'
cask 'spotify-notifications'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-fontawesome'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'

# Packages
brew 'bash'
brew 'bash-completion'
brew 'caddy'
brew 'curl'
brew 'fping'
brew 'git'
brew 'go'
brew 'gopass'
brew 'go-delve/delve/delve'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'lnav'
brew 'mas'
brew 'nmap'
brew 'packer'
brew 'pandoc'
brew 'pinentry-mac'
brew 'pt'
brew 'pv'
brew 'python'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'xz'

# Apps
mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'DaisyDisk', id: 411643860
mas 'Deliveries', id: 924726344
mas 'Divvy', id: 413857545
mas 'JSON Toolbox', id: 525015412
mas 'Microsoft Remote Desktop', id: 715768417
mas 'MindNode', id: 992076693
mas 'MsgFiler', id: 418778021
mas 'Textual', id: 896450579
mas 'Thumbtack', id: 500948998
